# ----------------------------------------------------------------------------------

# 接收用户输入的年份并转为整数
year = int(input("请输入需要判定的年份："))

# 闰年条件判断
if (year % 100 != 0 and year % 4 == 0) or (year % 400 == 0):
    print(f"{year} 是闰年")
else:
    print(f"{year} 是平年")

# ----------------------------------------------------------------------------------
num = int(input("请输入数字:"))

if num > 0:
    print(f"{num}是整数")
elif num < 0:
    print(f"{num}是负数")
else:
    print(f"{num}是0")

# ----------------------------------------------------------------------------------
"""
格式化快捷键：Option + Command + L
"""

# 1.接收输入的三角形的三个边的边长
a = int(input("请输入第一个边的边长："))
b = int(input("请输入第二个边的边长："))
c = int(input("请输入第三个边的边长："))

# 2.判断三角形的类型
if a + b > c and a + c > b and b + c > a:  # 条件成立，构成三角形
    if a == b and b == c:
        print(f"{a} {b} {c}这三个边长构成等边三角形")
    elif a == b or b == c or a == c:
        print(f"{a} {b} {c}这三个边长构成等腰三角形")
    else:
        print(f"{a} {b} {c}这三个边长构成普通三角形")
else:
    print(f"{a} {b} {c}这三个边长不构成三角形")


