# 算术运算符：+  -  *  /  //  %  **
print("10 + 4 = ", 10 + 4)  # 加
print("10 - 4 = ", 10 - 4)  # 减
print("10 * 4 = ", 10 * 4)  # 乘
print("10 / 4 = ", 10 / 4)  # 除 - 2.5
print("10 // 4 = ", 10 // 4) # 整除(结果为整数) - 2
print("10 % 4 = ", 10 % 4)  # 取余/求模 - 2
print("10 ** 4 = ", 10 ** 4)# 幂指数，10的4次方 - 10000

# 算术运算符的优先级 --> ** --> * / // % --> + -
print("0.1 + 10 / 4**2 = ", 0.1 + 10 / 4 ** 2)





# 案例：输入两个数 x 和 y ，计算 x + y 以及 x - y 的结果并输出
# float(,,,) ---> 将其他类型转为浮点数类型
x = float(input("请输入x的值："))
y = float(input("请输入y的值："))

print("x + y = ", x + y)    # x + y =  0.9
print("x - y = ", x - y)    # x - y =  0.09999999999999998      # 注意：计算机底层是基于二进制来进行数据的存储和处理的，而二进制无法精确表示所有的小数，因此在对小数进行存储和处理的过程中就会存在一定的精度丢失问题。



# ----------------------------------------------------------------------------------



# 赋值运算符：= += -= *= /= %= //= **=
num = 85

num += 10  # num = num + 10
print("num += 10 后, num = ", num)

num -= 10  # num = num - 10
print("num -= 10 后, num = ", num)

num *= 10  # num = num * 10
print("num *= 10 后, num = ", num)

num /= 10  # num = num / 10
print("num /= 10 后, num = ", num)

num //= 10  # num = num // 10
print("num //= 10 后, num = ", num)

num %= 3  # num = num % 3
print("num %= 3 后, num = ", num)

num **= 3  # num = num ** 3
print("num **= 3 后, num = ", num)




# ----------------------------------------------------------------------------------

# 比较运算符：==  !=  >  >=  <  <=
print("100 == 100 吗 : ", 100 == 100)      # True
print("'100' == '100' 吗 : ", "100" == "100")  # True
print("100 != 100 吗 : ", 100 != 100)      # False

print("100 < 100 吗 : ", 100 < 100)        # False
print("100 <= 100 吗 : ", 100 <= 100)      # True

print("100 > 100 吗 : ", 100 > 100)        # False
print("100 >= 100 吗 : ", 100 >= 100)      # True



# ----------------------------------------------------------------------------------


# 案例1：键盘输入一个整数，判断这个数字是否在 10-20 之间 --> 在: True，不在: False
n = int(input("请输入一个整数："))

# 写法1：使用 and 连接两个条件
print(f"{n}在10-20之间：", n >= 10 and n <= 20)

# 写法2：Python 连续比较写法（等价于写法1）
print(f"{n}在10-20之间：", 10 <= n <= 20)






# 案例2：键盘输入一个整数，判断这个数字是否不在10-20之间
n = int(input("请输入一个整数："))

# 使用 or 连接两个条件，满足其一则为 True
print(f"{n}不在10-20之间：", n < 10 or n > 20)