"""
数据结构与算法的关系

数据结构 + 算法 = 程序

数据结构只是静态的描述了数据元素之间的关系，是存储和组织数据的方式。
高效的程序需要在数据结构的基础上设计和选择算法

算法是为了解决实际问题而设计的，数据结构是算法需要处理问题的载体

最常用的数据运算有五种：
插入，删除，修改，查找，排序等

--------------------------------------------------------------------------------
1. 数据结构是什么？
数据结构是存储、组织数据的方式．精心选择的数据结构可以带来更高的运行或者存储效率

2. 数据结构与算法的关系？
算法是为了解决实际问题而设计的，数据结构是算法需要处理问题的载体。高效的程序需要在数据结构的基础上设计和选择算法

--------------------------------------------------------------------------------
1. 数据结构的类型有哪两种？
    线性结构
    非线性结构

2. 线性结构的特点是什么？
    所有结点都最多只有一个直接前驱结点和一个直接后继结点
    例如：栈，队列

3. 非线性结构的特点什么？
    结点可能有多个直接前驱结点和多个直接后继结点
    例如：树，图

--------------------------------------------------------------------------------
顺序表：
    无论一体式结构还是分离式结构，顺序表在获取数据的时候直接通过下标偏移就可以找到数据所在空间的地址，而无需遍历后才可以获取地址．所以顺序表在获取地址操作时的时间复杂度：O(1)

--------------------------------------------------------------------------------
1. 线性结构根据存储方式可分为哪些类型？
    顺序表和链表

2. 顺序表的存储方式有哪两种？
    一体式存储和分离式存储

3. 顺序表获取指定位置元素的时间复杂度是？
    O(1)
"""
