import re

# 测试文本
s1 = "18809090000是我的手机号，188开头的，以00结尾的；我的另一个手机号是15500008888，两个QQ号分别是1259989092和13809091293821，邮箱为python666@163.com"

print(re.findall(r"188.*", s1))  # 1. 贪婪匹配：.* 任意字符出现0次或多次
print(re.findall(r"188.?", s1))  # 2. 非贪婪匹配：.? 任意字符出现0次或1次
print(re.findall(r"188.+", s1))  # 3. 贪婪匹配：.+ 任意字符出现1次或多次

# ---------------- 手机号精准匹配示例 ----------------
print(re.findall(r"188\d{8}", s1))  # 匹配188开头手机号：188 + 8位数字
print(re.findall(r"155\d{6,10}", s1))  # 匹配155开头，数字长度6~10位
print(re.findall(r"155\d{6,}", s1))  # 匹配155开头，数字最少6位，无上限

# ---------------- 字符集、边界符、完整手机号校验 ----------------
print(re.findall(r"1[38]\d{8}", s1))  # 第二位只能是3/8
print(re.findall(r"1[^38]\d{8}", s1))  # 第二位不能是3和8
print(re.findall(r"1[3-9]\d{8}", s1))  # 标准手机号：1开头，第二位3-9，后接8位数字
print(re.findall(r"^1[3-9]\d{9}", s1))  # 仅匹配**字符串开头**的手机号（^ 开头边界）
print(re.findall(r"^1[3-9]\d{9}$", s1))  # 整串严格校验手机号（^开头 $结尾，整个文本只能是手机号）

# ---------------- 邮箱正则匹配 ----------------
# 写法1：默认模式 \w
print(re.findall(r"\w+@\w+\.\w+", s1))
# \w 默认匹配：大小写字母a-z/A-Z、数字0-9、下划线_、中文/日韩等其他语言字符

# 写法2：添加 re.ASCII 限定符
print(re.findall(r"\w+@\w+\.\w+", s1, re.ASCII))
# re.ASCII 开启后，\w 仅匹配 ASCII 字符：a-z、A-Z、0-9、_
# 中文、日文、韩文等非英文字符不再被 \w 识别

# ---------------- 日期正则匹配 ----------------
s2 = "现在的时间是2026-02-06 10:05:25，今天的天气还可以，气温是28度 "

# 规则：\d{4}4 位年份 + - + \d{2}2 位月份 + - + \d{2}2 位日期
# 输出效果：['2026-02-06']
# 特点：返回完整整条日期字符串，不拆分年、月、日
print(re.findall(r"\d{4}-\d{2}-\d{2}", s2))

# () 代表捕获分组，括号内内容会单独提取
# 3 组括号分别捕获：年份、月份、日期
# 输出效果：[('2026', '02', '06')]
# 特点：以元组形式拆分返回年、月、日，方便单独取出对应数值
print(re.findall(r"(\d{4})-(\d{2})-(\d{2})", s2))
